Repository: python/pootle-python-org-backup
Catalog: tmxes/pt/documenting.tmx
Source language: en
Languages: pt

source: Building the documentation
pt: Construindo a documentação

source: You need to have Python 2.4 or higher installed; the toolset used to build the docs is written in Python. It is called *Sphinx*, it is not included in this tree, but maintained separately. Also needed are the docutils, supplying the base markup that Sphinx uses, Jinja, a templating engine, and optionally Pygments, a code highlighter.
pt: Você precisa ter o Python 2.4 ou maior instalado; a caixa de ferramenta utilizada para construir é escrita em Python. Ela é chamada *Sphinx*, ela não é incluída na raiz, mas é mantida separadamente. Também necessário é o docutils, fornecendo a base de marcação que o Sphinx usa, Jinja, um mecanismo de template, e opcionalmente Pygments, um destacador de código.

source: Using make
pt: Usando o make

source: to check out the necessary toolset in the `tools/` subdirectory and build the HTML output files. To view the generated HTML, point your favorite browser at the top-level index `build/html/index.html` after running "make".
pt: para obter a caixa de ferramenta necessária no subdiretório `tools/` e construir os arquivos de saída HTML. Para visualizar o HTML gerado, aponte seu browser favorito no index `build/html/index.html` após executar "make".

source: Available make targets are:
pt: Metas disponíveis do make são:

source: "html", which builds standalone HTML files for offline viewing.
pt: "html", que constrói arquivos HTML autônomos para visualização offline.

source: To create the CHM file, you need to run the Microsoft HTML Help Workshop over the generated project (.hhp) file.
pt: Para criar o arquivo CHM, você precisa executar o Microsoft HTML Help Workshop sobre o arquivo do projeto (.hhp) gerado.

source: "latex", which builds LaTeX source files as input to "pdflatex" to produce PDF documents.
pt: "latex", que constrói arquivos de código LaTeX como entrada do "pdflatex" para produzir documentos PDF.

source: "text", which builds a plain text file for each source file.
pt: "text", que constrói um arquivo de texto para cada arquivo de código.

source: Example::
pt: Exemplo::

source: See also
pt: Veja também

source: Paragraphs
pt: Parágrafos

source: Source Code
pt: Código Fonte

source: Comments
pt: Comentários

source: Style Guide
pt: Guia de Estilo
